Ran Plan for 2 projects:

1. dir: `terraform/03_observability` workspace: `default`
1. dir: `terraform/05_cicd` workspace: `default`

### 1. dir: `terraform/03_observability` workspace: `default`
<details><summary>Show Output</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
~ update in-place

Terraform will perform the following actions:

  # module.kube-prometheus.helm_release.helm will be updated in-place
~ resource "helm_release" "helm" {
        id                         = "kube-prometheus-stack"
      ~ metadata                   = [
          - {
              - app_version = "v0.66.0"
              - chart       = "kube-prometheus-stack"
              - name        = "kube-prometheus-stack"
              - namespace   = "kube-prometheus"
              - revision    = 13
              - values      = jsonencode(
                    {
                      - grafana = {
                          - envValueFrom  = {
                              - GF_AUTH_GOOGLE_CLIENT_ID     = {
                                  - secretKeyRef = {
                                      - key  = "client-id"
                                      - name = "gsuite"
                                    }
                                }
                              - GF_AUTH_GOOGLE_CLIENT_SECRET = {
                                  - secretKeyRef = {
                                      - key  = "client-secret"
                                      - name = "gsuite"
                                    }
                                }
                            }
                          - "grafana.ini" = {
                              - auth          = {
                                  - disable_login_form = true
                                }
                              - "auth.google" = {
                                  - allow_sign_up   = true
                                  - allowed_domains = "shutthegoatup.com"
                                  - auth_url        = "https://accounts.google.com/o/oauth2/auth"
                                  - auto_login      = true
                                  - client_id       = "notsecret"
                                  - client_secret   = "notsecret"
                                  - enabled         = true
                                  - hosted_domain   = "shutthegoatup.com"
                                  - scopes          = "https://www.googleapis.com/auth/userinfo.profile https://www.googleapis.com/auth/userinfo.email"
                                  - token_url       = "https://accounts.google.com/o/oauth2/token"
                                  - use_pkce        = true
                                }
                              - server        = {
                                  - root_url = "https://grafana.shutthegoatup.com"
                                }
                            }
                          - ingress       = {
                              - enabled          = true
                              - hosts            = [
                                  - "grafana.shutthegoatup.com",
                                ]
                              - ingressClassName = "nginx"
                              - path             = "/"
                              - pathType         = "Prefix"
                            }
                        }
                    }
                )
              - version     = "47.1.0"
            },
        ] -> (known after apply)
        name                       = "kube-prometheus-stack"
      ~ values                     = [
          - <<-EOT
                ---
                grafana:  
                  ingress:
                    enabled: true
                    ingressClassName: nginx
                    hosts:
                      - grafana.shutthegoatup.com
                    path: /
                    pathType: Prefix
                  grafana.ini:
                    server:
                      root_url: https://grafana.shutthegoatup.com
                    auth:
                      disable_login_form: true
                    auth.google:
                      enabled: true
                      allow_sign_up: true
                      auto_login: true
                      client_id: notsecret
                      client_secret: notsecret
                      scopes: https://www.googleapis.com/auth/userinfo.profile https://www.googleapis.com/auth/userinfo.email
                      auth_url: https://accounts.google.com/o/oauth2/auth
                      token_url: https://accounts.google.com/o/oauth2/token
                      allowed_domains: shutthegoatup.com
                      hosted_domain: shutthegoatup.com
                      use_pkce: true
                  envValueFrom:
                    GF_AUTH_GOOGLE_CLIENT_ID:
                      secretKeyRef:
                        name: gsuite
                        key: client-id
                    GF_AUTH_GOOGLE_CLIENT_SECRET:
                      secretKeyRef:
                        name: gsuite
                        key: client-secret
            EOT,
          + <<-EOT
                ---
                grafana:  
                  ingress:
                    enabled: true
                    ingressClassName: nginx
                    hosts:
                      - grafana.shutthegoatup.com
                    path: /
                    pathType: Prefix
                  grafana.ini:
                    server:
                      root_url: https://grafana.shutthegoatup.com
                    auth:
                      disable_login_form: true
                    auth.google:
                      enabled: true
                      allow_sign_up: true
                      auto_login: true
                      client_id: notsecret
                      client_secret: notsecret
                      scopes: https://www.googleapis.com/auth/userinfo.profile https://www.googleapis.com/auth/userinfo.email
                      auth_url: https://accounts.google.com/o/oauth2/auth
                      token_url: https://accounts.google.com/o/oauth2/token
                      allowed_domains: shutthegoatup.com
                      hosted_domain: shutthegoatup.com
                      use_pkce: true
                  envValueFrom:
                    GF_AUTH_GOOGLE_CLIENT_ID:
                      secretKeyRef:
                        name: gsuite
                        key: client-id
                    GF_AUTH_GOOGLE_CLIENT_SECRET:
                      secretKeyRef:
                        name: gsuite
                        key: client-secret
            EOT,
        ]
        # (26 unchanged attributes hidden)
    }

Plan: 0 to add, 1 to change, 0 to destroy.
```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -d terraform/03_observability`
* :put_litter_in_its_place: To **delete** this plan click [here](http://atlantis.shutthegoatup.com/lock?id=shutthegoatup%252Fhomelab%252Fterraform%252F03_observability%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -d terraform/03_observability`
</details>
Plan: 0 to add, 1 to change, 0 to destroy.

---
### 2. dir: `terraform/05_cicd` workspace: `default`
**Plan Error**
<details><summary>Show Output</summary>

```
running "/usr/local/bin/terraform1.4.6 plan -input=false -refresh -out \"/atlantis-data/repos/shutthegoatup/homelab/25/default/terraform/05_cicd/default.tfplan\"" in "/atlantis-data/repos/shutthegoatup/homelab/25/default/terraform/05_cicd": exit status 1
data.kubernetes_secret_v1.input_vars: Reading...
data.kubernetes_secret_v1.vault_token: Reading...
data.kubernetes_secret_v1.vault_token: Read complete after 0s [id=vault/vault-root-token]
data.kubernetes_secret_v1.input_vars: Read complete after 0s [id=default/input-vars]
module.vault-config.vault_policy.admin: Refreshing state... [id=admin]
module.vault-config.vault_mount.kvv2: Refreshing state... [id=kvv2]
module.vault-config.vault_jwt_auth_backend.oidc: Refreshing state... [id=oidc]
module.vault-config.vault_kv_secret_v2.secrets["github-webhook-secret"]: Refreshing state... [id=kvv2/data/github-webhook-secret]
module.vault-config.vault_kv_secret_v2.secrets["cloudflare"]: Refreshing state... [id=kvv2/data/cloudflare]
module.vault-config.vault_kv_secret_v2.secrets["atlantis-github-app"]: Refreshing state... [id=kvv2/data/atlantis-github-app]
module.vault-config.vault_kv_secret_v2.secrets["arc-github-app"]: Refreshing state... [id=kvv2/data/arc-github-app]
module.vault-config.vault_kv_secret_v2.secrets["gsuite"]: Refreshing state... [id=kvv2/data/gsuite]
module.vault-config.vault_jwt_auth_backend_role.role: Refreshing state... [id=auth/oidc/role/admin]
module.vault-secrets-operator.vault_audit.aduit: Refreshing state... [id=file]
module.vault-secrets-operator.vault_auth_backend.kubernetes: Refreshing state... [id=kubernetes]
module.vault-secrets-operator.kubernetes_namespace.ns: Refreshing state... [id=vault-secrets-operator]
module.vault-secrets-operator.vault_policy.vso: Refreshing state... [id=vso]
module.vault-secrets-operator.vault_kubernetes_auth_backend_role.vso: Refreshing state... [id=auth/kubernetes/role/vso]
module.vault-secrets-operator.helm_release.vault-secrets-operator: Refreshing state... [id=vault-secrets-operator]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
 <= read (data resources)

Terraform planned the following actions, but then encountered a problem:

  # module.vault-config.vault_jwt_auth_backend.oidc will be updated in-place
  ~ resource "vault_jwt_auth_backend" "oidc" {
        id                     = "oidc"
      # Warning: this attribute value will be marked as sensitive and will not
      # display in UI output after applying this change. The value is unchanged.
      ~ oidc_client_id         = (sensitive value)
      ~ provider_config        = {
          + "fetch_groups"             = "true"
          + "fetch_user_info"          = "true"
          + "groups_recurse_max_depth" = "5"
          + "gsuite_admin_impersonate" = "allan@shutthegoatup.com"
          + "gsuite_service_account"   = (sensitive value)
            # (1 unchanged element hidden)
        }
        # (14 unchanged attributes hidden)
    }

  # module.vault-config.vault_kv_secret_v2.secrets["arc-github-app"] will be updated in-place
  ~ resource "vault_kv_secret_v2" "secrets" {
        id                  = "kvv2/data/arc-github-app"
        name                = "arc-github-app"
        # (8 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.vault-config.vault_kv_secret_v2.secrets["atlantis-github-app"] will be updated in-place
  ~ resource "vault_kv_secret_v2" "secrets" {
        id                  = "kvv2/data/atlantis-github-app"
        name                = "atlantis-github-app"
        # (8 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.vault-config.vault_kv_secret_v2.secrets["cloudflare"] will be updated in-place
  ~ resource "vault_kv_secret_v2" "secrets" {
        id                  = "kvv2/data/cloudflare"
        name                = "cloudflare"
        # (8 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.vault-config.vault_kv_secret_v2.secrets["github-webhook-secret"] will be updated in-place
  ~ resource "vault_kv_secret_v2" "secrets" {
        id                  = "kvv2/data/github-webhook-secret"
        name                = "github-webhook-secret"
        # (8 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.vault-config.vault_kv_secret_v2.secrets["gsuite"] will be updated in-place
  ~ resource "vault_kv_secret_v2" "secrets" {
        id                  = "kvv2/data/gsuite"
        name                = "gsuite"
        # (8 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.vault-secrets-operator.data.kubernetes_config_map_v1.ca will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "kubernetes_config_map_v1" "ca" {
      + binary_data = (known after apply)
      + data        = (known after apply)
      + id          = (known after apply)

      + metadata {
          + generation       = (known after apply)
          + name             = "kube-root-ca.crt"
          + namespace        = "kube-public"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }
    }

Plan: 0 to add, 6 to change, 0 to destroy.
╷
│ Error: Invalid function argument
│ 
│   on ../modules/vault-secrets-operator/main.tf line 15, in resource "helm_release" "vault-secrets-operator":
│   15:   values = [templatefile("${path.module}/values.yaml.tpl", {
│   16:     vault-kube-auth-role = vault_kubernetes_auth_backend_role.vso.role_name
│   17:     namespace            = var.namespace
│   18:   })]
│     ├────────────────
│     │ while calling templatefile(path, vars)
│     │ path.module is "../modules/vault-secrets-operator"
│ 
│ Invalid value for "path" parameter: no file exists at
│ "../modules/vault-secrets-operator/values.yaml.tpl"; this function works
│ only with files that are distributed as part of the configuration source
│ code, so if this file will be created by a resource in this configuration
│ you must instead obtain this result from an attribute of that resource.
╵


```
</details>

---
* :fast_forward: To **apply** all unapplied plans from this pull request, comment:
    * `atlantis apply`
* :put_litter_in_its_place: To delete all plans and locks for the PR, comment:
    * `atlantis unlock`